In [6]:
import openpyxl as oxl

print("openpyxl Ver : ", oxl.__version__)

openpyxl Ver :  3.0.5

In [7]:
from openpyxl import Workbook, load_workbook

In [25]:
wb2 = load_workbook("주소록.xlsx")
print(wb2.sheetnames)

['Sheet', '두번째시트', 'Sheet1', '네번째시트']

In [26]:
ws = wb2['두번째시트']

In [27]:
list(ws.iter_rows())

[(<Cell '두번째시트'.A1>, <Cell '두번째시트'.B1>),
 (<Cell '두번째시트'.A2>, <Cell '두번째시트'.B2>),
 (<Cell '두번째시트'.A3>, <Cell '두번째시트'.B3>),
 (<Cell '두번째시트'.A4>, <Cell '두번째시트'.B4>),
 (<Cell '두번째시트'.A5>, <Cell '두번째시트'.B5>),
 (<Cell '두번째시트'.A6>, <Cell '두번째시트'.B6>)]

In [28]:
for row in ws.iter_rows():
    for cell in row:
        print(cell, cell.value)

<Cell '두번째시트'.A1> 이름
<Cell '두번째시트'.B1> 전화번호
<Cell '두번째시트'.A2> 홍길동
<Cell '두번째시트'.B2> 02-302-3333
<Cell '두번째시트'.A3> 김길동
<Cell '두번째시트'.B3> 010-222-3334
<Cell '두번째시트'.A4> 박길동
<Cell '두번째시트'.B4> 010-5252-1234
<Cell '두번째시트'.A5> None
<Cell '두번째시트'.B5> 02-302-3333
<Cell '두번째시트'.A6> 홍길동
<Cell '두번째시트'.B6> 7777777

In [33]:
for col in ws.iter_cols():
    for cell in col:
        print(cell, cell.value)

<Cell '두번째시트'.A1> 이름
<Cell '두번째시트'.A2> 홍길동
<Cell '두번째시트'.A3> 김길동
<Cell '두번째시트'.A4> 박길동
<Cell '두번째시트'.A5> None
<Cell '두번째시트'.A6> 홍길동
<Cell '두번째시트'.B1> 전화번호
<Cell '두번째시트'.B2> 02-302-3333
<Cell '두번째시트'.B3> 010-222-3334
<Cell '두번째시트'.B4> 010-5252-1234
<Cell '두번째시트'.B5> 02-302-3333
<Cell '두번째시트'.B6> 7777777

In [32]:
import pandas as pd

In [34]:
print(pd.__version__)

1.1.3

In [35]:
# numpy C나 C++로 적혀있음(?)
# read_csv()
# read_excel()

In [37]:
dat=pd.read_excel("주소록.xlsx", sheet_name='두번째시트')
dat

    이름           전화번호
0  홍길동    02-302-3333
1  김길동   010-222-3334
2  박길동  010-5252-1234
3  NaN    02-302-3333
4  홍길동        7777777

In [41]:
a=list(dat.iterrows())
#print(len(a))
#print(a[0])
#print(a[0][1])

print(a[0][1][0])

홍길동

In [40]:
for idx, row in dat.iterrows():
    print(idx, row[0], row[1])

0 홍길동 02-302-3333
1 김길동 010-222-3334
2 박길동 010-5252-1234
3 nan 02-302-3333
4 홍길동 7777777

In [42]:
dat

    이름           전화번호
0  홍길동    02-302-3333
1  김길동   010-222-3334
2  박길동  010-5252-1234
3  NaN    02-302-3333
4  홍길동        7777777

In [43]:
dat_ori=dat.copy()

In [44]:
dat['전화번호']

0      02-302-3333
1     010-222-3334
2    010-5252-1234
3      02-302-3333
4          7777777
Name: 전화번호, dtype: object

In [45]:
#dat.loc[행, 열]
dat.loc[dat['이름'].isnull() , : ]

    이름         전화번호
3  NaN  02-302-3333

In [46]:
dat.loc[dat['이름'].notnull(), : ]

    이름           전화번호
0  홍길동    02-302-3333
1  김길동   010-222-3334
2  박길동  010-5252-1234
4  홍길동        7777777

In [48]:
dat.loc[dat['이름'].isnull(), "이름체크"]="NOK"
dat.loc[dat['이름'].notnull(), "이름체크"]="OK"
dat

    이름           전화번호 이름체크
0  홍길동    02-302-3333   OK
1  김길동   010-222-3334   OK
2  박길동  010-5252-1234   OK
3  NaN    02-302-3333  NOK
4  홍길동        7777777   OK

In [49]:
#실습-전화번호가 있는지 없는지 체크해보기

In [51]:
dat.loc[dat['전화번호'].isnull(), "전화번호체크"]="NOK"
dat.loc[dat['전화번호'].notnull(), "전화번호체크"]="OK"
dat

    이름           전화번호 이름체크 전화번호체크
0  홍길동    02-302-3333   OK     OK
1  김길동   010-222-3334   OK     OK
2  박길동  010-5252-1234   OK     OK
3  NaN    02-302-3333  NOK     OK
4  홍길동        7777777   OK     OK

In [52]:
#(추가실습)
#전화번호 길이 체크 12,13자리가 맞으면 OK, 아니면 NOK
#(전화번호길이체크컬럼 만들기)

In [55]:
phone_number_len_check = (dat['전화번호'].str.len() == 12) | (dat['전화번호'].str.len() == 13)

dat.loc[phone_number_len_check, '전화번호길이체크'] = 'OK'
dat.loc[~phone_number_len_check, '전화번호길이체크'] = 'NOK'
dat

    이름           전화번호 이름체크 전화번호체크 전화번호길이체크
0  홍길동    02-302-3333   OK     OK      NOK
1  김길동   010-222-3334   OK     OK       OK
2  박길동  010-5252-1234   OK     OK       OK
3  NaN    02-302-3333  NOK     OK      NOK
4  홍길동        7777777   OK    NOK      NOK

In [56]:
dat['전화번호'].str.contains("\d{2,3}-\d{3,4}-\d{4}")

0     True
1     True
2     True
3     True
4    False
Name: 전화번호, dtype: bool

In [57]:
tel = dat['전화번호'].str.contains("\d{2,3}-\d{3,4}-\d{4}")

In [58]:
dat.loc[tel, "전화번호형식체크"]="OK"
dat.loc[~tel, "전화번호형식체크"]="NOK"
dat

    이름           전화번호 이름체크 전화번호체크 전화번호길이체크 전화번호형식체크
0  홍길동    02-302-3333   OK     OK      NOK       OK
1  김길동   010-222-3334   OK     OK       OK       OK
2  박길동  010-5252-1234   OK     OK       OK       OK
3  NaN    02-302-3333  NOK     OK      NOK       OK
4  홍길동        7777777   OK    NOK      NOK      NOK

In [74]:
writer = pd.ExcelWriter("주소록_chk.xlsx", engine='openpyxl')
dat_ori.to_excel(writer, sheet_name="sheet_ori", index=False)
dat.to_excel(writer, sheet_name="sheet_chk", index=False)
writer.save()